IDEA Connection Link
ConnectionLink.OpenIdeaConnectionInternal Method
 Opens the application Idea Connection and waits till this application is closed
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public void OpenIdeaConnectionInternal(
	IdeaConImportSettings IdeaConImportSettings,
	IDEAProgress IDEAProgress,
	IIdeaProject IdeaProject,
	ref string nameOfFile
)
Public Sub OpenIdeaConnectionInternal (
	IdeaConImportSettings As IdeaConImportSettings,
	IDEAProgress As IDEAProgress,
	IdeaProject As IIdeaProject,
	ByRef nameOfFile As String
)
public:
void OpenIdeaConnectionInternal(
	IdeaConImportSettings^ IdeaConImportSettings,
	IDEAProgress^ IDEAProgress,
	IIdeaProject^ IdeaProject,
	String^% nameOfFile
)
Parameters
IdeaConImportSettings
Type: IdeaConImportSettings
IdeaConImportSettings
IDEAProgress
Type: IDEAProgress
IDEAProgress
IdeaProject
Type: IIdeaProject
IdeaProject
nameOfFile
Type: System.String
Returns name of file
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace